<a href="https://colab.research.google.com/github/SOUJU07/Ineuron/blob/master/Pandas_data_cleaning_assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [78]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
                   'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
                   'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})

In [79]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [80]:
df1=df[['FlightNumber']]
df1

   FlightNumber
0       10045.0
1           NaN
2       10065.0
3           NaN
4       10085.0

In [81]:
df1.iloc[1].fillna(10055,inplace=True)
df1

   FlightNumber
0       10045.0
1       10055.0
2       10065.0
3           NaN
4       10085.0

In [82]:
df1.iloc[3].fillna(10075,inplace=True)
df1

   FlightNumber
0       10045.0
1       10055.0
2       10065.0
3       10075.0
4       10085.0

In [83]:
df['FlightNumber']=df1.astype(int)

In [84]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [85]:
tp=pd.DataFrame(df['From_To'].str.split('_').tolist(),columns=['From','To'])
tp

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [86]:
tp['From']=tp['From'].str.capitalize()
tp['To']=tp['To'].str.capitalize()

In [87]:
tp

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [88]:
df.drop(axis=1,columns=['From_To'],inplace=True)
df=pd.concat([df,tp],axis=1)
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each
second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.

In [89]:
df2=pd.DataFrame(df.RecentDelays.tolist())
df2

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.

In [90]:
delays=df2.rename(columns={0:'delay_1',1:'delay_2',2:'delay_3'})
delays

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [91]:
df.drop(axis=1,columns=['RecentDelays'],inplace=True)
df

   FlightNumber              Airline      From         To
0         10045               KLM(!)    London      Paris
1         10055    <Air France> (12)    Madrid      Milan
2         10065  (British Airways. )    London  Stockholm
3         10075       12. Air France  Budapest      Paris
4         10085          "Swiss Air"  Brussels     London

In [92]:
df=pd.concat([df,delays],axis=1)
df

   FlightNumber              Airline      From  ... delay_1  delay_2  delay_3
0         10045               KLM(!)    London  ...    23.0     47.0      NaN
1         10055    <Air France> (12)    Madrid  ...     NaN      NaN      NaN
2         10065  (British Airways. )    London  ...    24.0     43.0     87.0
3         10075       12. Air France  Budapest  ...    13.0      NaN      NaN
4         10085          "Swiss Air"  Brussels  ...    67.0     32.0      NaN

[5 rows x 7 columns]